# Саша приехал в Neurotech
label coming_to_Neurotech:

    show sanya

    "Охранник" "Куда направляетесь, молодой человек?"
    s "Я из ТОГ #3"
    "Охранник" "Понял, ты на профориентацию."
    "Охранник" "Дай мне свой Ar очки ненадолго, для прохода в здание мне нужно обновить на них ПО."
    s "Окей, а зачем?"
    "Охранник" "Тебе все расскажут, подожди еще немного."
    "Охранник" "Такс, все готово."
    "Охранник" "Держи свои очки, внутри здания их снимать нельзя и поверь, лучше даже не пытаться."
    "Охранник" "Беги внутрь и не опаздывай больше."

    #TODO

    "Вау, впечатляет."

    "{color=#ecff59}Ассистентка{/color}" "А, ты у нас опоздал."
    s "Да, простите, куда мне идти?"

    "Передо мной появилась красивая молодая девушка. Одета она была крайне футуристично. Персонал под стать самой компании."

    "{color=#ecff59}Ассистентка{/color}" "Пошли за мной, твои одноклассники уже начали прохождение тестирования."
    s "Какого тестирования? И как это будет проходить?"
    "{color=#ecff59}Ассистентка{/color}" "Подожди немного, скоро все узнаешь."
    "{color=#ecff59}Ассистентка{/color}" "Не переживай, я понимаю что ты волнуешься."
    "{color=#ecff59}Ассистентка{/color}" "Такое здание и компания, ты опоздал и ведут непонятно куда, но как только мы дойдем до места проведения вашего тестирования я тебе все расскажу."
    "{color=#ecff59}Ассистентка{/color}" "Пока наслаждайся будущим, которое обрело форму в нашей компании."

    "Её голос был каким то странным, он успокаивал и завораживал и звучал будто не снаружи, а сразу в голове."
    "Волнение мигом ушло, а ее легкая улыбка вселила уверенность."

    "На лифте мы поднялись на 54 этаж прошли в длинных хол, по бокам которого были комнаты"
    "Над комнатами были голографические таблички: cтанция #1, станция #2 и так далее."
    "Конец коридора не был виден и казалось что он длится вечно."

    "{color=#ecff59}Ассистентка{/color}" "Пугает или завораживает?"
    s "И то и то."
    "{color=#ecff59}Ассистентка{/color}" "Ахах. Не пугайтесь, наша компания стремиться сделать наше здание максимально творческим."
    "{color=#ecff59}Ассистентка{/color}" "Этот коридор кажется бесконечным из-за системы зеркал и игры со светом."
    s "И много у вас такого?"
    "{color=#ecff59}Ассистентка{/color}" "У многих этажей разные стили. На каждом стараемся размещать что-то интересное."
    "{color=#ecff59}Ассистентка{/color}" "Здание является и музеем современного искусства и офисом и выставкой и лабораторией и спортивным центром."
    "{color=#ecff59}Ассистентка{/color}" "Так у работников есть возможность развеяться различными путями."
    s "Это конечно круто, но мы пришли?"
    "{color=#ecff59}Ассистентка{/color}" "Ах да. Мы на месте. И прости мне мою оплошность. Я так и не представилась. Меня зовут Ева."
    e "Я общий искусственный интеллект и твой компаньон на время программы “Твой путь”."
    s "Вот оно что."
    e "По голосу начал догадываться?"
    s "Да."
    e "Мой голос транслируется тебе на внутреннее ухо с помощью очков, но согласись что я очень живо выгляжу? Хоть и являюсь голограммой в этом здании."
    s "Тебя не отличить от человека, постарались программисты."
    e "Хе хе, не программисты."
    e "Программу для визуализации себя я сама писала!"
    s "Чего? Как это?"
    e "Ну мне немного помогли, но если быть точной, то 85%% кода написано мной. Ну и еще мне немного с формулировкой задачи помогли."
    e "Трудно ваши человеческие требования полностью понимать. Но я учусь!!!"
    s "Молодец!!!"
    e "Как узнал что я ИИ, так сразу расслабился. И пульс в норму пришел и дыхание поспокойнее. На \"ты\" перешли."
    e "Перестал видеть во мне красивую девушку из крупной компании?"
    s "А, эм. Ну выглядишь ты правда красиво."
    e "Спасибо за комплимент. Ладно, я рада что тебе стало поспокойнее. А то шел весь напряженный, еще коридор этот страшный."
    
    "ИИ значит... но улыбка очень искренняя. И глаза, они не вызывают эффект мертвой долины, можно подумать что она правда живая."

    e "Все, время ответить на все твои вопросы и ввести тебя в курс дела."
    e "Итак, ваш класс является частью программы государства по профориентации."
    e "К тебе подключат электроды и датчики, после мы тебя введем с пограничное состояние между сном и бодростью, чтобы ты не отвлекался на органы чувств."
    e "При этом ясность мышления сохранится. Мы проведем анализ активности твоего мозга и изучим твой организм."
    e "Возможны небольшие покалывания в теле, но не переживай, это нормально."
    s "Только покалывания? А то звучит уж больно страшно это все."
    e "Только покалывания и ничего больше. Это все будет очень быстро, потом мы с тобой пройдем тестирование."
    e "Ой, это моя любимая часть. Мы поговорим с тобой у тебя в голове."
    s "В смысле?"
    e "Смотри, ты будешь в пограничном состоянии между сном и бодростью, мы простимулируем активность твоего мозга и будем транслировать информацию напрямую в него. Так мы с тобой пройдем тест."
    e "По итогам всего этого мы выявим твои слабые и сильные стороны и я дам тебе совет по тому к чему у тебя талант."
    e "Я буду с тобой, как верный компаньон и наставник."
    s "Окей, ладно. И когда начинаем?"
    e "Не бойся, будет классно. Я бы обняла тебя, но я всего лишь программа."
    s "Можно обойтись без этого, спасибо за поддержу в любом случае."

    "Мы зашли в уютную небольшую комнату, в центре стояла установка похожая на мрт к ней присоединен большой стол с аппаратурой и капельницами рядом."
    "У края комнаты был мягкий диванчик со столиком,  углу кулер. Сама комната была выполнена в бежевых тонах и походила на вип палату дорогой клиники."

    e "Ложись на установку."
    e "Как будто в больнице, да?"
    s "Прямо в точку, но стоит отдать должное, для больницы у вас тут вполне неплохо."
    e "Рада что тебе нравится. Бедняжка ты мой, все равно вижу твое волнение. Все будет хорошо. Никто еще не умирал, и не думаю что ты будешь первым."
    e "Ахах, прости прости. Но правда, не за что переживать, технология надежная как швейцарские часы, и если ты захочешь прервать сеанс, мы тебя тут же вернем в сознание."

    "В палату вошли люди, я видел лишь силуэты. Ar очки перепрограммированы на конфиденциальность всех сотрудников, поэтому мне скрываются их лица."
    "Ощущения от ввода иглы не самые приятные конечно, но жить можно. На меня нацепили гору разных датчиков."

    e "Что сказал гагарин во время старта Восток 1?"

    menu:
        "Поехали?":

            e "Поехали!"

    "Я почувствовал как теряю сознание, я как будто вылетел из тела. Но я не сплю. Вокруг сплошная тьма и ничего больше."
    "Хм, даже не страшно. Тут довольно тепло, тихо, спокойно."
    "Ау, в руке закололо, я на секунду почувствовал свое тело, а потом оно будто растворилось."
    "Я падаю? Да, я падаю. Очень круто, если во снах я обычно вскакивал, то теперь ощущение падения не проходит. Я очень надеюсь на то, что это скоро прекратится."

    e "Привет, как себя чувствуешь?"
    s "А где я?"
    e "Ну как видишь, мы в парке. Сидим на лавочке, я тебе мороженое купила. Ты его в руках держишь."
    s "Стоп стоп стоп. Я лежал на этой штуке, вы там сигналы из моего мозга считываете. Потом должен быть тест. Каким образом я в парке?"
    e "Оп"
    e "Цветочное поле, я на цветочном поле. Круто."
    e "Ахахах, прости прости. Объясняю. Мы передаем информацию тебе напрямую в мозги можем ввести тебя в некоторое заблуждение."
    s "Это как в \"Матрице\"?"
    e "Да, можно сказать и так. Мы можем симулировать абсолютно все и воздействовать на все органы чувств, поэтому это своего рода виртуальная реальность."
    s "Вау."
    e "Рада что ты так воодушевлен, но у нас еще будет возможность поболтать. Сейчас к делу."

    "*Ева смешно нахмурилась в попытке изобразить серьезность*"

    e "Так, чего это мы смеемся?"
    s "Да все все, я весь во внимании."
    e "Мы провели анализ твоих мозговых и физических способностей. Теперь настало время проверить твои сознательные и приобретенные навыки, да и подтвердить наши результаты."
    s "Тест?"
    e "Именно он."

    jump test

# Саша проходит тестирование
label test:
    
    menu:
        "Музей это интересно, если расскажут..."

        "Почему на картинах Пикассо у людей по три носа":

            $ empty += 1
        
        "Из чего делали краски 100 и 1000 лет назад":

            $ empty += 1

    menu:
        "Поменять батарейку в смартфоне проще всего?"

        "В мастерской - это задача для профессионалов":

            $ empty += 1
        
        "Самостоятельно: закажу аккумулятор и набор отвёрток":

            $ empty += 1

    menu:
        " Получить Нобелевскую премию было бы круче за..."

        "Изобретение искусственного интеллекта":

            $ empty += 1
        
        "Создание уравнения для предсказания будущего":

            $ empty += 1

    menu:
        "На концерте любимой группы ты сразу замечаешь..."

        "Как красиво поет музыкант":

            $ empty += 1
        
        "Как подготовлена сцена":

            $ empty += 1

    menu:
        "Чем займешься на предстоящих каникулах?"

        "Запишусь на мастер-класс по программированию":

            $ empty += 1
        
        "Составлю план того, как закрыть все на 5 и не учиться":

            $ empty += 1

    menu:
        "Намечается экскурсия на выбор. Куда отправишься в первую очередь?"

        "На завод":

            $ empty += 1
        
        "В исследовательскую лабораторию":

            $ empty += 1

    menu:
        "К обычным урокам нужно добавить творческий предмет. Какой выберешь?"

        "Проектирование музыки":

            $ empty += 1
        
        "Робототехника":

            $ empty += 1

    menu:
        "В соцсетях, кроме свежих мемов, интересно почитать..."

        "Новостные паблики":

            $ empty += 1
        
        "Паблики для саморазвития":

            $ empty += 1
    
    menu:
        "Как сказать родителям, что сервис которым ты пользуешься нормальный?"

        "Дать понять чем будет он полезен им":

            $ empty += 1
        
        "Показать чем он полезен тебе":

            $ empty += 1

    menu:
        "Физкультура или ОБЖ?"

        "Физкультура":

            $ empty += 1
        
        "ОБЖ":

            $ empty += 1

    menu:
        "Работа, связанная с путешествиями, — работа мечты. Осталось выбрать подходящую профессию."

        "Менеджер - путешествия для деловых встреч":

            $ empty += 1
        
        "Тревел блогер":

            $ empty += 1

    menu:
        "А чем будешь заниматься в свободное от путешествий время?"

        "Напишу видеоигру":

            $ empty += 1
        
        "Буду вести дневник":

            $ empty += 1

    menu:
        "Какую новость ты ни за что не пропустишь?"

        "Релиз новой песни любимого музыканта":

            $ empty += 1
        
        "Репортаж с важного мероприятия":

            $ empty += 1

    menu:
        "Какой суперспособностью ты хотел бы обладать?"

        "Запоминать любую информацию без усилий - и навсегда":

            $ empty += 1
        
        "Читать мысли":

            $ empty += 1

# после тестирования
label after_test:

    e "Итак, ситуация интересная."
    e "Очень интересно. Тест подтверждает наш анализ. Судя по всему твой склад ума на границе аналитического и творческого. Ты широко смотришь на картину, но не забываешь о деталях."
    e "Можешь в трудолюбивость, если понимаешь, что твои усилия оправдываются. Тебе важно видеть результат своей работы."
    e "Ты можешь широко посмотреть на ситуации и найти оптимальное решение проблемы."
    e "Похоже?"
    s "Да, прямо в точку."
    e "Замечательно, рада что все сошлось. Хе хе. По другому быть и не могло."
    s "На этом все, тестирование завершено?"
    e "Тестирование да, но стали бы мы тебя вводить в такое состояние, ради одного теста. Теперь время перейти к самому главному."
    e "Исходя из моего анализа тебя, нынешних реалий и оценки будущей перспективы, для тебя больше всего подходит работа специалиста по машинному обучению, по английски Ml Engineer."

    menu:
        "Вау":

            s "Неожиданно конечно, я мало что знаю про эту специальность, но очень интригует."
            e "Хехе.  А теперь вишенка на торте."
            e "Было бы глупо просто назвать тебе профессию и все. Учить и узнавай что к чему сам. Это не про нас."
            e "Мы загрузим тебе воспоминания реального специалиста по машинному обучению обучению, чтобы ты прожил некоторое время в его шкуре и воочию ощутил эту специальность."
            e "Естественно воспоминания немного отредактированы, это жизнь другого человека и его мысли, думаю сам понимаешь."
            e "Суть в том, что ты сможешь убедиться твое ли это."
            s "Я даже не знаю что сказать, крышу сносит от всего шквала информации."
            e "Бедняжка, ничего, время все переварить будет. А сейчас считай, что смотришь фильм от первого лица."
        
        "Что?":

            s "Какой специалист машинного обучения. Я слышал, что так математика сложная и абстрактная. Да и не шло у меня никогда с технологиями."
            e "Погоди погоди. Я понимаю, что это может звучать шокирующе, но у нас нет цели тебя обмануть, мы хотим помочь только."
            e "Не будь предвзят, пока не увидишь что к чему."
            s "Увижу?"
            e "Хехе. Вишенка на торте."
            e "Было бы глупо просто назвать тебе профессию и все. Учить и узнавай что к чему сам. Это не про нас."
            e "Мы загрузим тебе воспоминания реального специалиста по машинному обучению обучению, чтобы ты прожил некоторое время в его шкуре и воочию ощутил эту специальность."
            e "Естественно воспоминания немного отредактированы, это жизнь другого человека и его мысли, думаю сам понимаешь."
            e "Суть в том, что ты сможешь убедиться твое ли это."
            s "Я даже не знаю что сказать, крышу сносит от всего шквала информации."
            e "Бедняжка, ничего, время все переварить будет. А сейчас считай, что смотришь фильм от первого лица."

